/*
-------------------------------------------------------
استيراد مكتبة React
-------------------------------------------------------

نحتاج React لتشغيل الكومبوننتات وبناء واجهة التطبيق.
*/

import React from 'react'


/*
-------------------------------------------------------
استيراد ReactDOM
-------------------------------------------------------

ReactDOM مسؤول عن ربط تطبيق React مع الصفحة
في المتصفح (DOM).
*/

import ReactDOM from 'react-dom/client'


/*
-------------------------------------------------------
استيراد الكومبوننت الرئيسي للتطبيق
-------------------------------------------------------

App هو الجذر الرئيسي للتطبيق.
كل صفحات ومكونات اللعبة تبدأ من هنا.
*/

import App from './App'


/*
-------------------------------------------------------
استيراد ملف التنسيقات العامة
-------------------------------------------------------

index.css يحتوي على التنسيقات الأساسية
التي تطبق على كامل التطبيق.
*/

import './index.css'


/*
-------------------------------------------------------
تشغيل التطبيق وربطه بالصفحة
-------------------------------------------------------

createRoot يقوم بإنشاء جذر React داخل عنصر HTML
الذي يحمل id = root.

هذا العنصر موجود في ملف:
index.html

مثال:
<div id="root"></div>
*/

ReactDOM.createRoot(
  document.getElementById('root')
).render(

  /*
  هنا يتم تشغيل الكومبوننت الرئيسي للتطبيق
  */

  <App />
)